#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el

**** Entangler
Automatically tangle our Emacs.org config file when we save it
#+begin_src emacs-lisp
  (defun prma/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/willow/home/emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'prma/org-babel-tangle-config)))
#+end_src

#+RESULTS:
| (lambda nil (add-hook 'after-save-hook #'prma/org-babel-tangle-config)) | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-tempo-setup | (closure (t) nil (set (make-local-variable 'company-backends) '(company-org-block)) (company-mode 1)) | org-superstar-mode | evil-org-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | prma/org-mode-setup | (closure (t) nil (display-line-numbers-mode 0)) | org-eldoc-load |

#+begin_src emacs-lisp
    (require 'org-tempo)
#+end_src

#+begin_src emacs-lisp
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("els" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("go" . "src go"))
(add-to-list 'org-structure-template-alist '("rs" . "src rust"))
#+end_src
